# Apply Functions to Multiple Columns

In [7]:
import pandas as pd
import numpy as np 
stuff = {
    'Corporation':['Apple', 'Google', 'Meta', 'Apple', 'Google','Meta'],
    'Employees':['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
    'Salary':[200, 220, 190, 130, 120, 150]}
my_df = pd.DataFrame(stuff)
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [8]:
def times1000(x):
    return format(x*1000,',d')

In [9]:
my_df['Salary'].apply(times1000)

0    200,000
1    220,000
2    190,000
3    130,000
4    120,000
5    150,000
Name: Salary, dtype: object

In [10]:
my_df['Salary'] = my_df['Salary'].apply(times1000)
my_df

  Corporation Employees   Salary
0       Apple      John  200,000
1      Google     April  220,000
2        Meta       Wes  190,000
3       Apple      Beth  130,000
4      Google    Justin  120,000
5        Meta     Steph  150,000

In [11]:
def namer(x):
    return "Coders: " + x

In [13]:
my_df[['Corporation','Employees']].apply(namer)

      Corporation       Employees
0   Coders: Apple    Coders: John
1  Coders: Google   Coders: April
2    Coders: Meta     Coders: Wes
3   Coders: Apple    Coders: Beth
4  Coders: Google  Coders: Justin
5    Coders: Meta   Coders: Steph

In [14]:
my_df[['Corporation','Employees']] = my_df[['Corporation','Employees']].apply(namer)

In [15]:
my_df

      Corporation       Employees   Salary
0   Coders: Apple    Coders: John  200,000
1  Coders: Google   Coders: April  220,000
2    Coders: Meta     Coders: Wes  190,000
3   Coders: Apple    Coders: Beth  130,000
4  Coders: Google  Coders: Justin  120,000
5    Coders: Meta   Coders: Steph  150,000